{
  "foxglove": "Digitalis ( or ) is a genus of about 20 species of herbaceous perennial plants, shrubs, and biennials, commonly called foxgloves.\nDigitalis is native to Europe, Western Asia, and northwestern Africa. The flowers are tubular in shape, produced on a tall spike, and vary in colour with species, from purple to pink, white, and yellow. The name derives from the Latin word for \"finger\". The genus was traditionally placed in the figwort family, Scrophulariaceae, but phylogenetic research led taxonomist...",
  "grape hyacinth": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth, but they should not be confused with hyacinths. A number of species of Muscari are used as ornamental garden plants....",
  "monkshood": "Aconitum (), also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous, frequently toxic perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere in North America, Europe, and Asia, growing in the moisture-retentive but well-draining soils of mountain meadows.\nMost Aconitum species are extremely poisonous and must be handled ...",
  "prince of wales feathers": "Không có thông tin mô tả.",
  "marigold": "Marigold may refer to:\n\nMarigold (color), a yellow-orange color\nIt may also refer to:...",
  "colt's foot": "Coltsfoot is the common name for several plants in the family Asteraceae:\n\nHomogyne alpina, a plant species native to Europe\nPetasites, a plant genus native to Europe, Asia, and North America\nTussilago farfara, a plant species native to Europe and parts of Asia and Africa...",
  "tree mallow": "Malva arborea (previously known as Lavatera arborea, or, more recently as Malva eriocalyx), the tree mallow, is a species of mallow native to the coasts of western Europe and the Mediterranean region, from Ireland and Britain south to Algeria and Libya, and east to Greece....",
  "pink primrose": "Oenothera speciosa is a species in the evening primrose family known by several common names, including pinkladies, pink evening primrose, showy evening primrose, Mexican primrose, and buttercups (not to be confused with true buttercups in the genus Ranunculus)....",
  "balloon flower": "Platycodon grandiflorus (from Ancient Greek πλατύς \"wide\" and κώδων \"bell\") is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia (China, Korea, Japan, and the Russian Far East). It is commonly known as balloon flower (referring to the balloon-shaped flower buds), Chinese bellflower, or platycodon....",
  "clematis": "Clematis is a genus of about 380 species within the buttercup family, Ranunculaceae. Their garden hybrids and cultivars have been popular among gardeners, beginning with Clematis 'Jackmanii', a garden staple since 1862. More cultivars are being produced constantly,  mainly of Chinese and Japanese origin....",
  "great masterwort": "Great masterwort is the common name of several flowering plants in the genus Astrantia, including:\n\nAstrantia maxima (\"largest\"), with pinkish-white flowers\nAstrantia major (\"larger\"), with greenish-white flowers with reddish shades...",
  "gazania": "Gazania là một chi thực vật có hoa trong họ Cúc (Asteraceae)....",
  "blanket flower": "Gaillardia  (common name blanket flower) is a genus of flowering plants in the family Asteraceae, native to North and South America. It was named after Maître Gaillard de Charentonneau, an 18th-century French magistrate who was an enthusiastic botanist. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use....",
  "oxeye daisy": "Leucanthemum vulgare, commonly known as the ox-eye daisy, oxeye daisy, dog daisy, marguerite (French: Marguerite commune, \"common marguerite\") and other common names, is a widespread flowering plant native to Europe and the temperate regions of Asia, and an introduced plant to North America, Australia and New Zealand...."
}